*** Custom Box Smart Pointer
  #+BEGIN_SRC rust
    use std::ops::Deref;

    struct MyBox<T>(T);

    impl<T> MyBox<T> {
        fn new(x: T) -> MyBox<T> {
            MyBox(x)
        }
    }

    impl <T> Deref for MyBox<T> {
        type Target = T; // declaring an associated type (?)

        fn deref(&self) -> &T {
            // We return a reference, because if we returned the value
            // itself, it would be moved out; but we want smart pointers
            // to own their values.
            &self.0 // this .0 syntax, don't think I've seen it before (?)
        }

    }

    // If we get a ref to something that is a ref to the required type (&str), and
    // it implements the Deref trait, Rust will apply deref automatically. A String
    // can be derefed to a string slice:
    // https://doc.rust-lang.org/std/string/struct.String.html#impl-Deref.

    // So, in a way, this auto-deref functionality is multi-level; if Rust can
    // obtain what it wants (in this case, a string slice) by applying deref more
    // than once, it will do it.
    fn give_me_a_string_slice(slice: &str) {
        println!("Delicious slice: {}", slice);
    }

    fn main() {
        let x = 5;
        let boxed_x = MyBox::new(x);
        assert_eq!(5, x);

        // this wouldn't work if we didn't implement the Deref trait
        // and is equivalent to *(y.deref())
        assert_eq!(5, *boxed_x);

        let slice = MyBox::new(String::from("cake"));
        give_me_a_string_slice(&slice);
        // without auto-deref, we'd have to build the slice from a String manually:
        give_me_a_string_slice(&(*slice)[..]); // eew, ugly

        // a box, inside a box, which can be derefed:
        let box_in_a_box = MyBox::new(slice);
        give_me_a_string_slice(&box_in_a_box); // wow, amaze
    }
  #+END_SRC

  #+RESULTS:
  : Delicious slice: cake
  : Delicious slice: cake
  : Delicious slice: cake

*** RefCell Cons
  #+BEGIN_SRC rust
    use List::{Cons, Nil};
    use std::rc::Rc;
    use std::cell::RefCell;

    #[derive(Debug)]
    enum List {
        Cons(Rc<RefCell<i32>>, Rc<List>),
        Nil,
    }

    fn main() {
        let value = Rc::new(RefCell::new(10));
        let a = Rc::new(Cons(Rc::clone(&value), Rc::new(Nil)));

        // Why clone &a ? Because if we used  just `a`, then it would
        // be moved into `b`. And if we used just a reference, without
        // cloning, then it would not be reference counted - we'd probably
        // have to use lifetimes
        let b = Cons(Rc::new(RefCell::new(15)), Rc::clone(&a));
        let c = Cons(Rc::new(RefCell::new(20)), Rc::clone(&a));
        /*
        Result:

        b (15) -
                 \
                  > --> a (10) --> Nil
                 /
        c (20) -

        ,*/
        println!("a: {:?}", a);
        println!("b: {:?}", b);
        println!("c: {:?}", c);

        // Now, if we change the value that is referenced by `a`, it should be
        // reflected in `b` and `c`. `value`, which is a reference counted smart
        // pointer, needs to be dereferenced explicitly, by using `*`; deref
        // coercion does not come into play, as that only happens for function and
        // method parameters. Smart pointers deref to the underlying value; in this
        // case, we get a RefCell, which implements the `borrow_mut` method.
        *value.borrow_mut() = 42;
        println!("a: {:?}", a);
        println!("b: {:?}", b);
        println!("c: {:?}", c);
    }
  #+END_SRC

  #+RESULTS:
  : a: Cons(RefCell { value: 10 }, Nil)
  : b: Cons(RefCell { value: 15 }, Cons(RefCell { value: 10 }, Nil))
  : c: Cons(RefCell { value: 20 }, Cons(RefCell { value: 10 }, Nil))
  : a: Cons(RefCell { value: 42 }, Nil)
  : b: Cons(RefCell { value: 15 }, Cons(RefCell { value: 42 }, Nil))
  : c: Cons(RefCell { value: 20 }, Cons(RefCell { value: 42 }, Nil))

*** Recap
    #+NAME: recap.rs
    #+BEGIN_SRC rust
      use std::rc::Rc;
      use std::ops::Deref;

      struct MyPointer<T> {
          value: T,
      }

      impl<T> MyPointer<T> {
          fn new(x: T) -> MyPointer<T> {
              MyPointer {
                  value: x,
              }
          }
      }

      fn add(a: &i32, b: &i32) -> i32 {
          a + b
      }

      // Box - "take value, package it in a box, send it to some storage facility;
      // keep receipt". The receipt is the pointer; storage facility is heap
      // memory. Works for simple values (like ints), not just structures -
      // although it is rarely useful to box scalars.
      let a = 42;
      let boxed = Box::new(a);

      // Deref coercion is applied to function and method params, when types mismatch
      // and the argument is a reference that can deref into the required type.
      // println!("{}", a + boxed); // won't work; deref coercions apply only to refs; `boxed` is not a ref
      println!("add operator: {}", a + *boxed); // will work
      // println!("{}", add(&a, boxed)); // won't work - `boxed` is not a reference, so will not be derefed
      println!("add fn: {}", add(&a, &boxed)); // will work

      // Deref coercion can be applied recursively
      let boxed_in_a_box = Box::new(&boxed);
      println!("add fn, boxed in a box: {}", add(&a, &boxed_in_a_box));

      impl<T> Deref for MyPointer<T> {
          type Target = T;
          fn deref(&self) -> &T {
              &self.value
          }
      }

      let b = Rc::new(MyPointer {
          value: 42,
      });

      println!("add fn with MyPointer: {}", add(&a, &b)); // will work, because b can deref to &int (self.value is int, and Deref returns &self.value)
  #+END_SRC

  #+RESULTS: recap.rs
  : add operator: 84
  : add fn: 84
  : add fn, boxed in a box: 84
  : add fn with MyPointer: 84

*** Interior Mutability
    #+NAME: interior-mutability-simple.rs
     #+BEGIN_SRC rust
       use std::cell::Cell;
       // interior mutability (https://doc.rust-lang.org/std/cell/struct.Cell.html)
       #[derive(Debug)]
       struct Foo {
           a: u8,
           b: Cell<u8>,
       }

       // create an immutable instance
       let foo1 = Foo { a: 42, b: Cell::new(100) };
       //foo1.a = 43; // ERROR
       foo1.b.set(101);
       println!("{:?}", foo1);
     #+END_SRC

     #+RESULTS:
     : Foo { a: 42, b: Cell { value: 101 } }

    #+NAME: interior-mutability.rs
    #+BEGIN_SRC rust
      pub trait Messenger {
          fn send(&self, msg: &str);
      }

      pub struct LimitTracker<'a, T: 'a + Messenger> {
          messenger: &'a T,
          value: usize,
          max: usize,
      }

      impl<'a, T> LimitTracker<'a, T> where T: Messenger {
          pub fn new(messenger: &T, max: usize) -> LimitTracker<T> {
              LimitTracker {
                  messenger,
                  value: 0,
                  max,
              }
          }

          pub fn set_value(&mut self, value: usize) {
              self.value = value;
              let percentage_of_max = self.value as f64 / self.max as f64;
              if percentage_of_max >= 0.75 && percentage_of_max < 0.9 {
                  self.messenger.send("Over 75% of quota!");
              } else if percentage_of_max >= 0.9 && percentage_of_max < 1.0 {
                  self.messenger.send("Over 90% of quota!");
              } else if percentage_of_max >= 1.0 {
                  self.messenger.send("Quota consumed!");
              }
          }
      }

      use std::cell::RefCell;

      struct MockMessenger {
          sent_messages: RefCell<Vec<String>>,
      }

      impl MockMessenger {
          fn new() -> MockMessenger {
              MockMessenger { sent_messages: RefCell::new(vec![]) }
          }
      }

      impl Messenger for MockMessenger {
          fn send(&self, message: &str) {
              // this will result in a panic at runtime:
              // already borrowed: BorrowMutError
              // let mut mut_1 = self.sent_messages.borrow_mut();
              // let mut mut_2 = self.sent_messages.borrow_mut();
              // mut_1.push(String::from(message));
              // mut_2.push(String::from(message));

              // this will make the test fail, but not because of
              // a panic; it will fail because the count will be 2
              // instead of 1. I guess it does not panic because the
              // two mutable references are not "live" at the same time
              // self.sent_messages.borrow_mut().push(String::from(message));
              // self.sent_messages.borrow_mut().push(String::from(message));

              self.sent_messages.borrow_mut().push(String::from(message));
          }
      }

      let mock_messenger = MockMessenger::new();
      let mut limit_tracker = LimitTracker::new(&mock_messenger, 100);
      limit_tracker.set_value(80);
      assert_eq!(mock_messenger.sent_messages.borrow().len(), 2);
    #+END_SRC

    #+RESULTS: interior-mutability.rs

*** Reference Cycle
    #+BEGIN_SRC rust
      use std::rc::Rc;
      use std::cell::RefCell;
      use List::{Cons, Nil};

      #[derive(Debug)]
      enum List {
          Cons(i32, RefCell<Rc<List>>),
          Nil,
      }

      impl List {
          fn tail(&self) -> Option<&RefCell<Rc<List>>> {
              match *self {
                  List::Cons(_, ref item) => Some(item),
                  Nil => None,
              }
          }
      }

      fn main() {
          let a = Rc::new(Cons(5, RefCell::new(Rc::new(Nil))));
          println!("a rc: {}", Rc::strong_count(&a));
          println!("a tail: {:?}", a.tail());

          let b = Rc::new(Cons(10, RefCell::new(Rc::clone(&a))));
          println!("a rc after creating b: {}", Rc::strong_count(&a));
          println!("b rc: {}", Rc::strong_count(&b));
          println!("b tail: {:?}", b.tail());

          if let Some(link) = a.tail() {
              ,*link.borrow_mut() = Rc::clone(&b);
          }
          println!("a rc: {}", Rc::strong_count(&a));
          println!("b rc: {}", Rc::strong_count(&b));

          // Calling tail will result in stack overflow:
          // println!("a tail: {:?}", a.tail());
      }
    #+END_SRC

    #+RESULTS:
    : a rc: 1
    : a tail: Some(RefCell { value: Nil })
    : a rc after creating b: 2
    : b rc: 1
    : b tail: Some(RefCell { value: Cons(5, RefCell { value: Nil }) })
    : a rc: 2
    : b rc: 2

**** More Code
     #+BEGIN_SRC rust
       use std::cell::Cell;
       let foo = Cell::new(42);

       // set interior value ?
       //foo = 42; // ERROR: expected struct `std::cell::Cell`, found integer
       foo.set(100);

       // create new Cell instances, holding a copy of foo's internal value
       let a = foo.clone();
       let b = foo.clone();

       // get a copy (clone?) of the interior value
       let x = foo.get();
       let y = foo.get();

       println!("{:?}, {:?}, {:?}, {}, {}", foo, a, b, x, y);

       // take the value - leaves Default for the type (0 for u8)
       let c = foo.take();
       println!("{:?}, {:?}", foo, c);
     #+END_SRC

     #+RESULTS:
     : Cell { value: 100 }, Cell { value: 100 }, Cell { value: 100 }, 100, 100
     : Cell { value: 0 }, 100
**** Conclusion
     It looks like the main difference between the two is that ~Cell~ lacks the borrow methods - so the interior value cannot be borrowed, only cloned. With ~RefCell~, the value can be borrowed. The same value cannot be borrowed multiple times, except when all borrows are immutable. Basically, the "standard" borrow rules are applied at runtime; if a mutable reference is already taken and an attempt is made to borrow the value again, the program will panic and crash.
     
     - runtime error: thread 'main' panicked at 'already borrowed: BorrowMutError'
     #+BEGIN_SRC rust
       use std::cell::RefCell;
       let foo = RefCell::new(42);

       // this is fine; all borrows are immutable
       let a1 = foo.borrow();
       let a2 = foo.borrow();

       // the below will pass compilation, but will panic at runtime
       let a3 = foo.borrow_mut();
     #+END_SRC

     - runtime error: thread 'main' panicked at 'already mutably borrowed: BorrowError'
     #+BEGIN_SRC rust
       use std::cell::RefCell;
       let foo = RefCell::new(42);
       let a1 = foo.borrow_mut();
       let a2 = foo.borrow();
     #+END_SRC

Both can be used to implement interior mutability, but in different manners; with ~Cell~, we mutate wholesale, whereas with ~RefCell~, we can get a reference through which the value can be modified.

     #+BEGIN_SRC rust
       use std::cell::Cell;
       use std::cell::RefCell;
       #[derive(Debug)]
       struct Foo {
           a: u8,
           b: Cell<u8>,
           c: RefCell<u8>,
       }

       // create an immutable instance
       let foo1 = Foo { a: 42, b: Cell::new(101), c: RefCell::new(102) };

       //foo1.a = 43; // ERROR

       // interior mutability, Cell
       foo1.b.set(201);

       // interior mutability, RefCell
       *foo1.c.borrow_mut() = 202;
       *foo1.c.borrow_mut() = 203;
       // this also works...
       let mut c_ref = foo1.c.borrow_mut();
       *c_ref = 204;

       // but named references stay in scope, so with the following, will panic
       //let mut d_ref = foo1.c.borrow_mut();

       println!("{:?}", foo1);
     #+END_SRC

     #+RESULTS:
     : Foo { a: 42, b: Cell { value: 201 }, c: RefCell { value: <borrowed> } }

*** Box
    - https://doc.rust-lang.org/std/boxed/struct.Box.html
    - ~Box~ does not need to be imported
    - allocates stuff on heap - except for [[https://doc.rust-lang.org/nomicon/exotic-sizes.html#zero-sized-types-zsts][zero-sized types]] - no allocation take place
    - when ~Box~ goes out of scope, mem is dropped (de-allocated?)
    - once created, a ~Box~ cannot be updated to point to a different value - no ~get~, ~set~, etc
    - vs ~RefCell~ ? no interior mutability
     #+BEGIN_SRC rust
       let foo = Box::new(42);
       let n = 42;
       let bar = Box::new(n); // n is on the stack, and on the heap
       println!("{:?}, {:?}", foo, bar);
     #+END_SRC

     #+RESULTS:
     : 42, 42

